_org_data/2015-09-01-sqlite查询sea-orm.org
#+options: toc:nil ^:nil
#+begin_export md
---
layout: post
title:  "基础sqlite查询sea-orm"
date:   2015-09-01
tags:
      - it
---
#+end_export
#+TOC: headlines 1

* SQLite 3 一些基本的使用
https://www.yiibai.com/sqlite/sqlite_sub_queries.html

https://www.cnblogs.com/Mr_JinRui/archive/2010/05/12/1733662.html

#+begin_src sql
SELECT * FROM COMPANY WHERE ID IN (SELECT ID FROM COMPANY WHERE SALARY > 45000) ;
insert into revtbl select * from revtbl;
DROP VIEW IF EXISTS v_test;
CREATE VIEW IF NOT EXISTS v_test AS SELECT * FROM test;
#+end_src

* An async & dynamic ORM for Rust
An Object Relational Mapper (ORM) is a programming library to help you interact with a relational database from an Object-Oriented Programming (OOP) language.

https://www.sea-ql.org/SeaORM/docs/introduction/orm

https://zhuanlan.zhihu.com/p/417431284
